# Terminal & shell
cask "iterm2"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CLI tools
brew "gh"

# Modern CLI replacements (additive — originals keep working)
brew "eza"
brew "bat"
brew "ripgrep"
brew "fd"
brew "zoxide"
brew "dust"
brew "btop"

# Fuzzy + history
brew "fzf"
brew "atuin"

# Git ergonomics
brew "git-delta"

# Per-project env vars
brew "direnv"

# Fonts
cask "font-jetbrains-mono-nerd-font"

